# PointCloudColorSettings Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudColorSettings Constructor
PointCloudColorSettings Class See Also
---
Constructs color settings object with default colors.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public PointCloudColorSettings()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
PointCloudColorSettings()
```

# See Also
PointCloudColorSettings Class
PointCloudColorSettings Overload
Autodesk.Revit.DB.PointClouds Namespace